import random
from datetime import date, datetime as DT
from datetime import timedelta

# структура данных
class Generated_data():
    
    # конструктор
    def __init__(self, id, name, date_birth, number, id_ticket, arrival, destionation, date_arrival, count_bonus, weight, duration_fly, plane):
        self.id = id
        self.name = name
        self.date_birth = date_birth
        self.number = number
        self.id_ticket = id_ticket
        self.arrival = arrival
        self.destionation = destionation
        self.date_arrival = date_arrival
        self.count_bonus = count_bonus
        self.weight = weight
        self.duration_fly=duration_fly
        self.plane = plane
        
    # приведение к строковому виду
    def result(self):
        return str(self.id) + '|' + str(self.name) + '|' + str(self.date_birth) +'|'+ str(self.number)+ '|' + str(self.id_ticket) + '|' + str(self.arrival) + '|' + str(self.destionation) + '|' + str(self.date_arrival) + '|' + str(self.count_bonus) + '|' + str(self.weight) + '|' + str(self.duration_fly) +'|'+str(self.plane) 

# массивы данных
# массив ФИО
array_name = [
 'Гончаров Николай Максимович',  'Бобров Марк Родионович',  'Мельникова Маргарита Дмитриевна', 'Бычков Пётр Львович', 'Кузнецова Василиса Михайловна',
 'Леонов Ибрагим Дмитриевич', 'Воронин Максим Васильевич', 'Соколова Полина Кирилловна', 'Воронов Ярослав Михайлович', 'Моисеева Виктория Макаровна',
 'Калинина Ульяна Владимировна', 'Комаров Матвей Ильич', 'Егоров Алексей Фёдорович', 'Воронцова Ирина Платоновна', 'Коновалова Ангелина Андреевна',
 'Корнилова Арина Дмитриевна', 'Зайцев Даниил Даниилович', 'Соколов Гордей Егорович', 'Сазонова Ульяна Львовна', 'Терентьев Александр Вячеславович',
 'Ефимова Екатерина Тихоновна', 'Харитонов Матвей Кириллович', 'Степанов Роман Миронович', 'Русакова Алиса Андреевна', 'Кудрявцева Эмилия Алексеевна',
 'Беляев Владимир Артёмович', 'Серов Егор Семёнович', 'Баранова Айлин Никитична', 'Николаева Вера Михайловна', 'Кочетова Лидия Максимовна',
 'Вишневская Эмилия Ильинична', 'Блинова Анастасия Степановна', 'Морозов Герман Денисович', 'Копылова Екатерина Никитична', 'Егорова Ксения Михайловна',
 'Кудрявцев Камиль Игоревич', 'Жданова Злата Александровна', 'Петров Владимир Глебович', 'Коротков Максим Степанович', 'Макаров Андрей Сергеевич',
 'Рубцов Сергей Григорьевич', 'Баженова Кира Ивановна', 'Некрасова Мира Данииловна', 'Кузнецова Варвара Даниэльевна', 'Николаев Арсений Александрович',
 'Назарова Дарина Тимофеевна', 'Тихомиров Михаил Викторович', 'Журавлева Мария Сергеевна', 'Калмыкова Мирослава Максимовна', 'Васильева Анна Артёмовна',
 'Мухин Юрий Максимович', 'Логинова Ксения Тимофеевна', 'Козлова Ева Робертовна', 'Соколова Арина Михайловна', 'Соколов Роман Денисович',
 'Гусев Демид Дмитриевич', 'Нефедов Ярослав Дмитриевич', 'Маслова Мария Максимовна', 'Лебедева Елизавета Дмитриевна', 'Чистякова Александра Александровна',
 'Беляев Данила Тимофеевич', 'Киселев Тимофей Родионович', 'Иванова Мария Тимофеевна', 'Леонтьев Михаил Николаевич', 'Тарасова Алиса Платоновна',
 'Прохоров Павел Фёдорович', 'Бессонова Есения Романовна', 'Максимов Александр Владиславович', 'Серебряков Михаил Мирославович', 'Васильева Виктория Глебовна',
 'Денисова Ксения Сергеевна', 'Корнилова Анастасия Денисовна', 'Морозов Кирилл Константинович', 'Захаров Серафим Даниилович', 'Федоров Даниил Алиевич',
 'Смирнова Полина Мирославовна', 'Серов Гордей Макарович', 'Литвинова Василиса Михайловна', 'Морозова Алиса Андреевна', 'Ершова Анна Ильинична',
 'Давыдов Пётр Максимович', 'Ковалева Вера Матвеевна', 'Морозов Ярослав Максимович', 'Егоров Павел Константинович', 'Никитина София Дмитриевна',
 'Цветков Максим Антонович', 'Галкина Антонина Всеволодовна', 'Хомякова Елизавета Георгиевна', 'Семенова Милана Ильинична', 'Николаева Агата Сергеевна',
 'Андреева Злата Дмитриевна', 'Федотова Анастасия Кирилловна', 'Воробьев Али Никитич', 'Басова Кира Фёдоровна', 'Лапшин Тимур Арсентьевич', 'Павлова Ясмина Максимовна',
 'Егорова Юлия Денисовна', 'Макаров Михаил Георгиевич', 'Ларионова Елизавета Ярославовна', 'Мартынов Роберт Никитич', 'Медведева Ксения Георгиевна',
 'Лебедева Валентина Никитична', 'Орлов Александр Сергеевич', 'Фокина Анна Артёмовна', 'Фролова Анастасия Ивановна', 'Белоусова Елена Дмитриевна',
 'Орлов Роман Эмильевич', 'Белякова Анастасия Игоревна', 'Морозов Андрей Михайлович', 'Калинин Платон Ярославович', 'Клюев Иван Алексеевич', 'Иванов Кирилл Максимович ']
# массив пунктов отправления
array_arrival = [
        "Анадырь", "Архангельск", "Барнаул", "Благовещенск", "Брянск", "Владивосток", "Волгоград", "Грозный", "Жуковский", 
        "Казань", "Калуга", "Краснодар", "Курган", "Липецк", "Магнитогорск", "Минеральные_Воды", "Москва", "Нальчик", "Нижнекамск", 
        "Новокузнецк", "Омск", "Орск", "Пермь", "Петропавловск-Камчатский","Ростов-на-Дону", "Самара", "Саранск", "Симферополь", 
        "Ставрополь", "Сыктывкар", "Тюмень", "Ульяновск", "Хабаровск", "Чебоксары","Череповец", "Элиста", "Якутск"]
# массив пунктов прибытия
array_destionation = [
        "Абакан", "Анапа", "Астрахань", "Белгород", "Братск", "Варандей", "Владикавказ", "Воронеж", "Екатеринбург", "Иркутск",
        "Калининград", "Кемерово", "Красноярск", "Курск", "Магадан", "Махачкала", "Москва", "Мурманск", "Нижневартовск", "Нижний Новгород",
        "Новосибирск", "Оренбург", "Остафьево", "Петрозаводск", "Псков", "Сабетта", "Санкт-Петербург", "Саратов", "Сочи", 
        "Сургут", "Томск", "Улан-Удэ", "Уфа", "Ханты-Мансийск", "Челябинск", "Чита", "Южно-Сахалинск", "Ярославль"]
# массив компаний самолетов
array_companies = [
            "Airbus", "ATR", "Saab AB", "Антонов", "ОАК",
            "Сухой", "Иркут", "Туполев", "Ильюшин", "Boeing",
            "Douglas", "Bombardier", "Embraer"
        ]
# массив моделей самолетов
array_models =[
            "А220", "A300", "A310", "A318", "A319", "A320", "A321", "A330", "A340", "A350", "A380", "ATR 42", "ATR 72", "Saab 2000", "Saab 340",
            "Ан-2", "Ан-3", "Ан-4", "Ан-6", "Ан-8", "Ан-10", "Ан-12", "Ан-14", "Ан-22", "Ан-24", "Ан-26", "Ан-28", "Ан-30", "Ан-32", "Ан-34", "Ан-38", 
            "Ан-50", "Ан-70", "Ан-71", "Ан-72", "Ан-74", "Ан-124", "Ан-132",  "Ан-140", "Ан-148", "Ан-158", "Ан-168", "Ан-178", "Ан-180", "Ан-188", "Ан-218",
            "Ан-225", "Ан-318", "Ан-418", "Ил-96-300", "Ил-62М", "Ил-114", "Ту-160", "Ту-22М3", "Ту-95МС", "Ту-204", "Ту-214", "707", "717", "727",
            "737", "747", "757", "767", "777", "787", "BusinessJet", "B-52", "Chinook", "EA-18 Growler", "C-17", "YAL-1", "175", "EMB 110", 
            "EMB 120", "EMB 121", "ERJ 135", "ERJ 140", "ERJ 145", "E170", "E175", "E190", "E195", "E175-E2", "E190-E2", "E195-E2",
            "Legacy 600", "Lineage 1000", "Legacy 450", "Legacy 500", "Legacy 650", "Phenom 100", "Phenom 300", "Praetor 500","Praetor 600"
]

# генерация случайной даты
def get_random_date(start, end):
    delta = end - start
    return start + timedelta(random.randint(0, delta.days))
# дапазоны дат для генерации
start_dt_birth = DT.strptime('01.01.1940', '%d.%m.%Y')
end_dt_birth = DT.strptime('01.01.2020', '%d.%m.%Y')
start_dt_fly = DT.strptime('01.01.2019', '%d.%m.%Y')
end_dt_fly = DT.strptime('01.01.2024', '%d.%m.%Y')

# итоговоый массив данных    
array_res = []
# структура данных как будет в БД

# генерируем данные для БД
for i in range(1, 100001):
    dates_birth = str(get_random_date(start_dt_birth, end_dt_birth).date()).split('-')
    new_date_birth = dates_birth[2]+'.'+dates_birth[1]+'.'+dates_birth[0]
    dates_fly = str(get_random_date(start_dt_fly, end_dt_fly).date()).split('-')
    new_date_fly = dates_fly[2]+'.'+dates_fly[1]+'.'+dates_fly[0]

    data = Generated_data(
        i,  # id
        array_name[random.randint(0, len(array_name)-1)],  # ФИО
        new_date_birth, # дата рождения
        str(random.randint(10, 99))+' '+str(random.randint(10, 99))+' '+str(random.randint(100000, 999999)), # паспорт
        str(100000+i), # ID билета
        array_arrival[random.randint(0, len(array_arrival)-1)], # Пункт отправления
        array_destionation[random.randint(0, len(array_destionation)-1)], # Пункт назначения
        new_date_fly, # Дата отправления
        random.randint(0, 1000), # Количество бонусов
        random.randint(0, 20), # Вес багажа
        random.randint(0, 12), # Длительность полета
        array_companies[random.randint(0, len(array_companies)-1)] + ' ' + array_models[random.randint(0, len(array_models)-1)] # Самолет
        )
    array_res.append(data.result()) # кидаем в итоговый массив

# записываем данные в файл
with open("output.txt", "w", encoding='UTF-16') as file:
    for  line in array_res:
        file.write(line + '\n')
